[
    {
        "title": "React, Tremor & Tailwind - Coder Stats via GitHub API",
        "author": "Alicia Sykes",
        "postDate": "4th December, 2022",
        "featuredImg": "https://res.cloudinary.com/practicaldev/image/fetch/s--fQtOVhKm--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/35qggb3drgj7u4h3vjff.jpg",
        "Links": 124,
        "comments": 25,
        "bookmarked": 228,
        "tags": ["javascript", "beginners", "react", "webdev"],
        "content": "<p>Hello Coders!</p><p>This article mentions an open-source sample that presents the developer's stats pulled from GitHub free API and presents the information using&nbsp;<a href=\"https://github.com/app-generator/sample-tremor-github-charts\" rel=\"noopener noreferrer\" target=\"_blank\">React &amp; Tremor</a>&nbsp;Library. Thanks for reading!</p><ul><li>👉&nbsp;<a href=\"https://sample-tremor-github-charts.appseed-srv1.com/\" rel=\"noopener noreferrer\" target=\"_blank\">GitHub API &amp; Tremor</a>&nbsp;-&nbsp;LIVE demo</li><li>👉&nbsp;<a href=\"https://github.com/app-generator/sample-tremor-github-charts\" rel=\"noopener noreferrer\" target=\"_blank\">GitHub API &amp; Tremor</a>&nbsp;-&nbsp;source code</li></ul><p>The flow is pretty simple: Users input their username, the information is consumed from GitHub and the charts are displayed. For newcomers,&nbsp;Tremor&nbsp;is a modern stack built on top of&nbsp;<strong>Tailwind and ReCharts</strong>, focusing mainly on scientists and developers that develop dashboards and analytics products.</p>"
    },
    {
        "title": "How I Built a Vue.js Ecommerce Store with a Node.js Backend",
        "author": "Noble Okechi",
        "postDate": "7th December, 2022",
        "featuredImg": "https://res.cloudinary.com/practicaldev/image/fetch/s--Z0xiVtaQ--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/q1gwl5e58u119l9ed1qv.jpg",
        "Links": 23,
        "comments": 5,
        "bookmarked": 12,
        "tags": ["javascript", "beginners", "react", "webdev"],
        "content": "<p>E-commerce is no small undertaking. Aside from building a great customer experience on the front end, you'll also need to have the right setup to handle all cart, customer and order data, product information, etc…</p><p><br></p><p>In this tutorial, you'll get a sneak peek into how it can be done!</p><p><br></p><p>In this tutorial, you'll get set up with the necessary prerequisites for a great e-commerce experience.&nbsp;<a href=\"https://vuejs.org/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--darkreader-text--link-branded-color);\">Vue.js</a>&nbsp;is a great choice for a frontend framework because it's open source, it has a component-based architecture, and it is reactive.</p><p>For the backend, you'll learn how to use&nbsp;<a href=\"https://medusajs.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--darkreader-text--link-branded-color);\">Medusa</a>, an open-source Node.js commerce engine that ships with all necessary eCommerce functionality including an easily navigatable admin system.</p><p><br></p><p>The full code for this Vue.js project is located in&nbsp;<a href=\"https://github.com/noblefresh/vuejs-ecommerce\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--darkreader-text--link-branded-color);\">this GitHub repo</a>. Below is a quick sneak peek of the final result.</p><p><br></p><h3><strong>What is Vue.js</strong></h3><p><a href=\"https://github.com/vuejs/vue\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--darkreader-text--link-branded-color);\">Vue.js</a>&nbsp;is an open source progressive JavaScript framework. It can be used to build a variety of types of apps, including websites, mobile apps, or desktop apps. This can be done by using Vue.js along with other platforms like Electron or Ionic.</p><p>Vue.js has been rising in popularity since it was first released due to its many advantages. It is easy to learn and use, with concise documentation and a smooth learning curve. It also has a tiny size, a reactive system, and a component-based, reusable architecture.</p><p><br></p><h3><strong>What is Medusa</strong></h3><p><a href=\"https://github.com/medusajs/medusa\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--darkreader-text--link-branded-color);\">Medusa</a>&nbsp;is the #1 open-source, Node.js commerce platform on GitHub. Its composable and headless architecture allows it to be incorporated with any tech stack to build cross-platform e-commerce stores, ranging from web to android and iOS applications.</p><p>Medusa allows developers to build&nbsp;scalable and maintainable e-commerce stores. It ships with many advanced e-commerce features such as an admin store dashboard, product configurations, manual orders, multi-currency support, and much more. Likewise, it easily integrates with different&nbsp;<a href=\"https://medusajs.com/blog/build-a-video-game-store-with-medusa-next-js-stripe-algolia/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--darkreader-text--link-branded-color);\">payment</a>,&nbsp;<a href=\"https://medusajs.com/blog/ecommerce-storefront-medusa-strapi-remix/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--darkreader-text--link-branded-color);\">CMS</a>, and shipping options.</p><h3><em>Please star if you like the tool 🌟</em></h3><p><br></p>"
    },
    {
        "title": "Machine Learning Vs AI Vs DL",
        "author": "Techbenzy",
        "postDate": "17th December, 2021",
        "featuredImg": "https://res.cloudinary.com/practicaldev/image/fetch/s--Z0xiVtaQ--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/q1gwl5e58u119l9ed1qv.jpg",
        "Links": 12,
        "comments": 1,
        "bookmarked": 43,
        "tags": ["javascript", "beginners", "react", "webdev"],
        "content": "<p>Machine learning is a branch of artificial intelligence (AI) and computer science which focuses on the use of data and algorithms to imitate the way that humans learn, gradually improving its accuracy.</p><p><br></p><p>IBM has a rich history with machine learning. One of its own, Arthur Samuel, is credited for coining the term, “machine learning” with his research (PDF, 481 KB) (link resides outside IBM) around the game of checkers. Robert Nealey, the self-proclaimed checkers master, played the game on an IBM 7094 computer in 1962, and he lost to the computer. Compared to what can be done today, this feat almost seems trivial, but it's considered a major milestone within the field of artificial intelligence. Over the next couple of decades, the technological developments around storage and processing power will enable some innovative products that we know and love today, such as Netflix's recommendation engine or self-driving cars.</p><p><br></p><h2><strong>Machine Learning vs. Deep Learning vs. Neural Networks</strong></h2><p>Since deep learning and machine learning tend to be used interchangeably, it's worth noting the nuances between the two. Machine learning, deep learning, and neural networks are all sub-fields of artificial intelligence. However, deep learning is actually a sub-field of machine learning, and neural networks is a sub-field of deep learning.</p><p><br></p><p>The way in which deep learning and machine learning differ is in how each algorithm learns. Deep learning automates much of the feature extraction piece of the process, eliminating some of the manual human intervention required and enabling the use of larger data sets. You can think of deep learning as \"scalable machine learning\" as Lex Fridman notes in this MIT lecture (00:30) (link resides outside IBM). Classical, or \"non-deep\", machine learning is more dependent on human intervention to learn. Human experts determine the set of features to understand the differences between data inputs, usually requiring more structured data to learn.</p>"
    },
    {
        "title": "MIUI 13 Unveiled With Many New Features: List Of Supported Devices",
        "author": "Techbenzy",
        "postDate": "17th June, 2021",
        "featuredImg": "https://res.cloudinary.com/practicaldev/image/fetch/s--Z0xiVtaQ--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/q1gwl5e58u119l9ed1qv.jpg",
        "Links": 12,
        "comments": 1,
        "bookmarked": 43,
        "tags": ["javascript", "beginners", "react", "webdev"],
        "content": "<p>Although MIUI isn't a great UI, we would still buy Xiaomi phones in India as they offer almost if not the best specs for your bucks and more importantly has way better custom ROM support than any other brand right now in the budget to mid-range segment(things might change in future). It's not what a casual user would look for. Back in 2015 MIUI was so freaking smooth and user-friendly even on 7-9k devices. Xiaomi is plagued by success now. Just cleaner MIUI will crash the competition. It's the first piece of software that gave us an actual wow feeling. iOS is boring, we don't like Samsung's old software, nor Samsung's One UI (though it is an improvement over the old software). Stock android is too boring too but it is regarded as the fastest and most supportive version of android which comes with minimum bloat wares.</p><p><br></p><p>But MIUI just gives us a lot of bugs in the user interface. Yeah, it has some bugs here and there but for a lot of users, it's worth it. We believe Xiaomi's strategy from now on should be to price their phones slightly higher and in return gives us a clean UI experience. That way they can make more profit per device, and offer their users a hassle-free experience. MIUI 13 has been introduced by Xiaomi after a long wait. The User interface of the Xiaomi smartphones has been unveiled in China in an event. Xiaomi also introduced its Xiaomi 12 series smartphone at the same event. The new MIUI 13 is being referred to as an enhanced version of MIUI 12.5 and it will fix all the bugs of the previous version.</p><p><br></p><p>It has been reported that the new UI will deliver improved performance along with added features in the Xiaomi smartphones. The New MIUI 13 is coming with new system fonts and it is referred to as MiSans. While some of the other added features in the MIUI 13 are fraud protection, new widgets as well a privacy watermark. The company has also stated that the new MIUI 13 skin will be available to download for compatible Xiaomi, Redmi as well as POCO devices in January 2022. So let us get to know about some of the specialties and modifications made in the MIUI13 in detail. MIUI 11&amp;12 had many options that iOS got inspiration from, like the privacy settings. MIUI had those privacy notifications which Apple straight up copied.</p><p><br></p><p>The same modification has been followed in MIUI 13. They should include alarm controls below the volume panel, on pressing the volume button. We must be able to toggle and set the alarm here itself. Also, they can make a minimalistic media player show up below the volume panel when you're playing something. This should become a new standard in Android. China's MIUI 13 features don't mention during the global launch event for global ROM. Such as new notification sound, new privacy protection (protect clipboard, approximate location, file sandbox), MIUI+, redesign notes app, new volume slider, and haptic feedback. Only the notes app is added to the official Xiaomi website. MIUI keeps adding these useful privacy settings that help safeguard our privacy from the apps we would install.</p><p><br></p>"
    },
    {
        "title": "Why using just console.log in 2023 is a big no-no 🚀",
        "author": "Brian Altar",
        "postDate": "6th March, 2021",
        "featuredImg": "https://res.cloudinary.com/practicaldev/image/fetch/s--2jV2VCNA--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/lu2hoajzttjs6oire4p0.png",
        "Links": 1104,
        "comments": 123,
        "bookmarked": 443,
        "tags": ["javascript", "beginners", "react", "webdev"],
        "content": "Here are 5 must-know console object methods and tricks! Are you still using console.log for all your JavaScript debugging needs in 2023? It's time to upgrade your skills and discover the full power of the JavaScript console object. From console.table to console.time, these advanced methods and tricks will help you improve the quality and readability of your debug output and make it easier to troubleshoot and fix problems in your code. So why not join the ranks of the JavaScript ninja debuggers in 2023, and learn these essential techniques? Your code will thank you. 😞 The problem One of the biggest problems with using just console.log is that it can clutter up your code and make it difficult to read. Additionally, it's not very informative on its own. It just outputs the value of whatever you pass to it without any context or additional information. With that in mind, here are ten JavaScript console object methods and tricks you should know about (and give them a try; I know it is faster to just console.log, but it can make your debugging experience way better, do it for your future yourself!)."
    }
]